#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_logs_delete_keys will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs_delete_keys" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/DeleteExpiredKeys"
      + retention_in_days = 14
    }

  # aws_cloudwatch_log_group.lambda_logs_expired_user will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs_expired_user" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/GetExpiredUsers"
      + retention_in_days = 14
    }

  # aws_cloudwatch_log_group.lambda_logs_notify_svc_user will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs_notify_svc_user" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/NotifyServiceUserOwner"
      + retention_in_days = 14
    }

  # aws_cloudwatch_log_group.lambda_logs_user will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs_user" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/NotifyUserOwner"
      + retention_in_days = 14
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for lor lambda"
      + id          = (known after apply)
      + name        = "GetExpiredKeys"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "iam:ListUsers",
                          + "iam:GetUser",
                          + "iam:ListAccessKeys",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.lambda_logging_delete_keys will be created
  + resource "aws_iam_policy" "lambda_logging_delete_keys" {
      + arn         = (known after apply)
      + description = "IAM policy for lor lambda"
      + id          = (known after apply)
      + name        = "DeleteExpiredKeys"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "iam:ListUserTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.lambda_logging_notify_svc_user will be created
  + resource "aws_iam_policy" "lambda_logging_notify_svc_user" {
      + arn         = (known after apply)
      + description = "IAM policy for lor lambda"
      + id          = (known after apply)
      + name        = "NotifyServiceUserOwner"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.lambda_logging_user_notify will be created
  + resource "aws_iam_policy" "lambda_logging_user_notify" {
      + arn         = (known after apply)
      + description = "IAM policy for lor lambda"
      + id          = (known after apply)
      + name        = "NotifyUserOwner"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.step_function_policy will be created
  + resource "aws_iam_policy" "step_function_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for llambda"
      + id          = (known after apply)
      + name        = "step_function_policy"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-GetExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.iam_for_lambda_delete_keys will be created
  + resource "aws_iam_role" "iam_for_lambda_delete_keys" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-DeleteExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.iam_for_lambda_notify_svc_user will be created
  + resource "aws_iam_role" "iam_for_lambda_notify_svc_user" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-NotifyServiceUserOwner"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.iam_for_lambda_notify_user will be created
  + resource "aws_iam_role" "iam_for_lambda_notify_user" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-NotifyUserOwner"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.iam_for_sfn will be created
  + resource "aws_iam_role" "iam_for_sfn" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_sfn"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-GetExpiredKeys"
    }

  # aws_iam_role_policy_attachment.lambda_logs_delete_user will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs_delete_user" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-DeleteExpiredKeys"
    }

  # aws_iam_role_policy_attachment.lambda_logs_notify_user will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs_notify_user" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-NotifyUserOwner"
    }

  # aws_iam_role_policy_attachment.lambda_notify_svc_user will be created
  + resource "aws_iam_role_policy_attachment" "lambda_notify_svc_user" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-NotifyServiceUserOwner"
    }

  # aws_iam_role_policy_attachment.step_function_policy will be created
  + resource "aws_iam_role_policy_attachment" "step_function_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_sfn"
    }

  # aws_lambda_function.delete_expired_keys will be created
  + resource "aws_lambda_function" "delete_expired_keys" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/delete_expired_key.zip"
      + function_name                  = "DeleteExpiredUsers"
      + handler                        = "delete_expired_key.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "svPFn+toAWtWUsXHzyFUKfuucTClZg/MJ/VpmFOxdN0="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.get_expired_users will be created
  + resource "aws_lambda_function" "get_expired_users" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/get_expired_users.zip"
      + function_name                  = "GetExpiredUsers"
      + handler                        = "get_expired_users.get_expired_key"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "8Ra3zJwttiYrc2XB3fILKzCWi+mkSroU4RvYv+aeIW0="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.notify_service_user_owner will be created
  + resource "aws_lambda_function" "notify_service_user_owner" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/notify_service_user_owner.zip"
      + function_name                  = "NotifyServiceUserOwner"
      + handler                        = "notify_service_user_owner.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "vRf1rI9CVzKRUIQbCY6HFw4sSvdvXgF+T2ktcSTe1As="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.notify_user_owner will be created
  + resource "aws_lambda_function" "notify_user_owner" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/notify_user_owner.zip"
      + function_name                  = "NotifyUserOwner"
      + handler                        = "notify_user_owner.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "EFpAlXa9kNcYB/4aevl92lMo3HrHbjmZ7gzgkkzAV9c="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_sfn_state_machine.sfn_state_machine will be created
  + resource "aws_sfn_state_machine" "sfn_state_machine" {
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "KeysRotation"
      + role_arn      = (known after apply)
      + status        = (known after apply)
    }

  # aws_sns_topic.admin_notification will be created
  + resource "aws_sns_topic" "admin_notification" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "admin_notification"
      + policy = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `PR Builder`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`, Workspace: `default`*
